[{"id":"_2a9xi2ldp","title":"Who Invented Chicken Nuggets?","description":"Before McDonald's pioneered McNuggets for fast food consumption, a Cornell University researcher developed bite-size breaded chicken sticks that could be easily fried and frozen.","text":"During World War II, chicken became many Americans’ primary source of protein after the U.S. military commandeered red meat for soldiers, creating a beef shortage at home. The massive chicken demand incentivized businesses to produce the birds more cheaply, says anthropologist Steve Striffler, author of Chicken: The Dangerous Transformation of America’s Favorite Food: “World War II encouraged the spread, modernization and industrialization of chicken on a much larger scale.”\r\n\r\nLate in the war, the military came for chicken, too: “In the spring of 1945, the War Food Administration requisitioned almost 100 percent of the production in the Delmarva peninsula (spanning Delaware, Maryland and Virginia), a major poultry-producing area,” says Dr. Ashton Merck, history instructor at Duke University. “The army’s requisitions provided a crucial opening for southern and midwestern producers to gain inroads in lucrative Eastern markets.”\r\n\r\nWhen the war ended, poultry demand dropped. Red meat was no longer scarce, and chicken had a portion problem: At the time, most were sold whole. The birds were too small to feed all those postwar growing families, but too large for one person. Preparing whole roasts was a time-consuming task for women increasingly entering the workforce. It would take a new invention to reinvigorate the American appetite for chicken."},{"id":"_gub26t1n6","title":"Did William Henry Harrison Really Die From Pneumonia?","description":"Research suggests the ninth U.S. president may not have caught a deadly case of pneumonia after his long-winded inaugural address.","text":"It’s common wisdom that William Henry Harrison delivered one killer of a speech after being sworn in as the ninth president of the United States—and it had nothing to do with anything he said. \r\n\r\nIgnoring the advice of vigilant mothers everywhere, “Old Tippecanoe” swore off his overcoat, hat and gloves while giving his inaugural address on a freezing, wet winter day. And in a quest to prove his virility while silencing critics who thought him an intellectual lightweight, the 68-year-old Harrison definitely overcompensated by delivering a whopping 8,445-word speech that droned on for nearly two hours. Many believe that history’s lengthiest inaugural address led directly to the briefest of presidencies as Harrison died exactly one month later on April 4, 1841—with the official cause listed as pneumonia.It is unlikely, however, that the long-winded speech caused the president’s death because he didn’t become sick, complaining of anxiety and fatigue, until more than three weeks after his inauguration. Plus Harrison’s lung ailments didn’t arise until the fifth day of his illness and were not nearly as relentless or progressive as the severe abdominal discomfort and constipation he experienced.\r\n\r\nAfter taking a fresh look at the case, Jane McHugh and Dr. Philip A. Mackowiak of the University of Maryland School of Medicine wrote in a 2014 edition of the journal Clinical Infectious Diseases that Harrison likely died from enteric fever, not from a fatal chill contracted during the inauguration. The pair pointed to contaminated drinking water as the true cause of Harrison’s demise. Before 1850, the sewage of Washington, D.C., was dumped in a fetid marsh just seven blocks upstream from the White House’s water supply, and the researchers surmised that bacteria seeped into the drinking water and caused the president’s severe gastroenteritis. Harrison’s history of dyspepsia put him at additional risk to the tainted water, which the authors noted may have also contributed to the death of another president, Zachary Taylor."}]